// Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет, является ли этот день выходным.

string day = Console.ReadLine();


if (day == "6")
{
    Console.WriteLine("weekend");
}

if (day == "7")
{
    Console.WriteLine("weekend");
}

if (day == "1") 
{
    Console.WriteLine("business days");
}

if (day == "2")
{
    Console.WriteLine("business days");
}

if (day == "3")
{
    Console.WriteLine("business days");
}

if (day == "4")
{
    Console.WriteLine("business days");
}

if (day == "5")
{
    Console.WriteLine("business days");
}

else Console.WriteLine("not a day");


