// Напишите программу, которая задаёт массив из 8 элементов и
// выводит их на экран.

int [] array = {1,6,4,7,8,3,2,9};
Console.WriteLine(array[0]);
Console.WriteLine(array[1]);
Console.WriteLine(array[2]);
Console.WriteLine(array[3]);
Console.WriteLine(array[4]);
Console.WriteLine(array[5]);
Console.WriteLine(array[6]);
Console.WriteLine(array[7]);

