// Напишите программу, которая принимает на вход число 
// и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

int SumDigits (int num)
{
    int allSum = 0; // если сумма, то нициализация 0, произведение = 1
    for (int i = 1; num >= 0; i++)
    {
        num = num / 10; 
    }
    return result;
}
int result = int.Parse(Console.ReadLine()!);
SumDigits(result);
Console.WriteLine(result);


